<?php
/**
 * tpshop
 * ============================================================================
 * * 版权所有 2015-2027 深圳搜豹网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.xfound.cn
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用 .
 * 不允许对程序代码以任何形式任何目的的再发布。
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 * $Author: IT宇宙人 2015-08-10 $
 */
	
	
	include "db.php";

	$sql = "select * from product  where id=1";
	//$res = $mod->exec($sql);
	//print_r($res);die;
	foreach($mod->query($sql) as $row){
		$count = $row['store'];
	}
	sleep(1);
	if($count<=0){
		echo "已经抢完";
		exit();
	}


	$sql = "update product set store=store-1 where id=1";
	if($mod->exec($sql) ){
		echo "库存更新成功";
	}
	
	
